# 项目：整理Netflix电影演员评分数据

## 分析目标

此数据分析的目的是，整理不同流派影视作品，比如喜剧片、动作片、科幻片中，各演员出演作品的平均IMDB评分，从而挖掘出各个流派中的高评分作品演员。

本实战项目的目的在于练习整理数据，从而得到可供下一步分析的数据。

## 简介

原始数据集记录了截止至2022年7月美国地区可观看的所有Netflix电视剧及电影数据。数据集包含两个数据表：`titles.csv`和`credits.csv`。

`titles.csv`包含电影及电视剧相关信息，包括影视作品ID、标题、类型、描述、流派、IMDB（一个国外的在线评分网站）评分，等等。`credits.csv`包含超过7万名出现在Netflix影视作品的导演及演员信息，包括名字、影视作品ID、人物名、演职员类型（导演/演员）等。

`titles.csv`每列的含义如下：
- id：影视作品ID。
- title：影视作品标题。
- show_type：作品类型，电视节目或电影。
- description：简短描述。
- release_year：发布年份。
- age_certification：适龄认证。
- runtime：每集电视剧或电影的长度。
- genres：流派类型列表。
- production_countries：出品国家列表。
- seasons：如果是电视剧，则是季数。
- imdb_id：IMDB的ID。
- imdb_score：IMDB的评分。
- imdb_votes：IMDB的投票数。
- tmdb_popularity：TMDB的流行度。
- tmdb_score：TMDB的评分。

`credits.csv`每列的含义如下：
- person_ID：演职员ID。
- id：参与的影视作品ID。
- name：姓名。
- character_name：角色姓名。
- role：演职员类型，演员或导演。

## 评估清理数据

import pandas as pd
import numpy as np

D1
1. 数据结构
`genres`和`production_countries`存在多个变量需要拆分
2. 数据类型
`release_year`数据类型应为日期
3. 数据缺失
`title`,`description`,`age_certification`,`seasons`,`imdb_id`,`imdb_score`,`imdb_votes`,`tmdb_popularity`,`tmdb_score`数据缺失
其余变量空缺值并不影响挖掘各个流派中的高IMDB评分作品演员，只评估imdb_score和genres，删除其变量空缺的观察值
5. 数据重复
不存在重复
6. 数据统一性
`genres`没有统一性问题，`production_countries`中的"Lebanon"和"LB"都是黎巴嫩，统一成"LB"
7. 数据异常
没有异常数据

D2
1. 数据结构
没有结构问题
2. 数据类型
`person_id`数据类型应为字符串
3. 数据缺失
`character`数据缺失，但不影响挖掘各个流派中的高IMDB评分作品演员，保留空缺观察值。
5. 数据重复
不存在重复
6. 数据统一性
没有统一性问题
7. 数据异常
没有异常数据

#### 处理titles.csv 为D1

In [9]:
D1=pd.read_csv("titles.csv").copy()
D1.sample(5)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
1835,tm362881,Mirai,MOVIE,Unhappy after his new baby sister displaces hi...,2018,PG,94,"['fantasy', 'animation', 'drama', 'family']",['JP'],NaN,tt6900448,7.0,14983.0,52.562,7.2
5165,tm1045741,Blue Miracle,MOVIE,"To save their cash-strapped orphanage, a guard...",2021,NaN,95,"['family', 'action', 'drama']","['MX', 'US']",NaN,tt7084386,6.6,6778.0,17.953,7.6
453,tm44530,Fashion,MOVIE,A small-town girl finally realizes her dream o...,2008,PG-13,167,"['drama', 'romance']",['IN'],NaN,tt0964516,6.9,12533.0,7.048,6.3
3820,tm494731,Sextuplets,MOVIE,Father-to-be Alan is shocked to learn that he ...,2019,NaN,97,['comedy'],['US'],NaN,tt8976710,4.4,8528.0,27.608,6.3
3971,ts256297,The Devil Punisher,SHOW,"A baker by day and demon fighter by night, Zho...",2020,NaN,70,"['scifi', 'fantasy', 'romance']",['TW'],1.0,tt13317376,5.8,161.0,5.671,9.0

#### 数据结构

In [12]:
D1["genres"][1]

"['drama', 'crime']"

In [14]:
D1["genres"]=D1["genres"].apply(eval)
D1["genres"][1]

['drama', 'crime']

In [16]:
D1=D1.explode("genres")

In [18]:
D1["production_countries"][1]

1    ['US']
1    ['US']
Name: production_countries, dtype: object

In [20]:
D1["production_countries"]=D1["production_countries"].apply(eval)

In [22]:
D1=D1.explode("production_countries")

In [24]:
D1["genres"].value_counts()

genres
drama            3517
comedy           2538
thriller         1505
action           1394
romance          1098
crime            1093
documentation    1085
animation         816
family            803
fantasy           738
european          699
scifi             676
horror            451
history           336
music             289
reality           241
war               232
sport             188
western            56
Name: count, dtype: int64

In [26]:
D1.sample(5)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
1987,ts56201,Cloudy with a Chance of Meatballs,SHOW,"The series is a prequel, featuring the high sc...",2017,TV-Y7,11,scifi,CA,2.0,tt7584168,3.4,750.0,8.750,5.6
928,tm71148,Thanks for Sharing,MOVIE,A romantic comedy that brings together three d...,2013,R,112,drama,US,NaN,tt1932718,6.4,28396.0,9.986,5.9
4095,tm817087,#AnneFrank. Parallel Stories,MOVIE,One single Anne Frank moves us more than the c...,2019,NaN,92,history,IT,NaN,tt9850370,6.5,1548.0,8.190,7.1
2169,tm427293,Solo,MOVIE,After falling off a cliff and suffering substa...,2018,NaN,100,drama,ES,NaN,tt6699860,5.0,2779.0,6.956,5.5
2473,ts68146,Myths & Monsters,SHOW,This documentary series tells the stories that...,2017,TV-PG,43,european,GB,1.0,tt7531644,7.7,841.0,1.804,7.4

#### 数据类型

In [29]:
D1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17818 entries, 0 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    17818 non-null  object
 1   title                 17817 non-null  object
 2   type                  17818 non-null  object
 3   description           17790 non-null  object
 4   release_year          17818 non-null  int64
 5   age_certification     10889 non-null  object
 6   runtime               17818 non-null  int64
 7   genres                17755 non-null  object
 8   production_countries  17439 non-null  object
 9   seasons               6224 non-null   float64
 10  imdb_id               17116 non-null  object
 11  imdb_score            16976 non-null  float64
 12  imdb_votes            16945 non-null  float64
 13  tmdb_popularity       17663 non-null  float64
 14  tmdb_score            17241 non-null  float64
dtypes: float64(5), int64(2), object(8)
memory usage: 2.2+ MB

In [31]:
D1["release_year"]=pd.to_datetime(D1["release_year"],format='%Y')

In [33]:
D1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17818 entries, 0 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    17818 non-null  object
 1   title                 17817 non-null  object
 2   type                  17818 non-null  object
 3   description           17790 non-null  object
 4   release_year          17818 non-null  datetime64[ns]
 5   age_certification     10889 non-null  object
 6   runtime               17818 non-null  int64
 7   genres                17755 non-null  object
 8   production_countries  17439 non-null  object
 9   seasons               6224 non-null   float64
 10  imdb_id               17116 non-null  object
 11  imdb_score            16976 non-null  float64
 12  imdb_votes            16945 non-null  float64
 13  tmdb_popularity       17663 non-null  float64
 14  tmdb_score            17241 non-null  float64
dtypes: datetime64[ns](1), float64(5), int64(1), object(8)
memory usage: 2.2+ MB

#### 数据缺失

In [36]:
D1=D1.dropna(subset="genres")

In [38]:
D1["genres"].isnull().sum()

0

In [40]:
D1=D1.dropna(subset="imdb_score")

In [42]:
D1["imdb_score"].isnull().sum()

0

#### 数据重复

In [45]:
D1.duplicated().sum()

0

#### 数据异常

In [48]:
D1.describe()

,release_year,runtime,seasons,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
count,16970,16970.000000,5954.000000,16970.000000,1.694100e+04,16842.000000,16515.000000
mean,2015-11-14 22:42:51.974072064,80.912552,2.455492,6.514207,3.281655e+04,29.396307,6.846933
min,1954-01-01 00:00:00,0.000000,1.000000,1.500000,5.000000e+00,0.600000,1.000000
25%,2015-01-01 00:00:00,45.000000,1.000000,5.800000,7.800000e+02,4.070000,6.200000
50%,2018-01-01 00:00:00,90.000000,2.000000,6.600000,3.508000e+03,10.195000,6.900000
75%,2020-01-01 00:00:00,107.000000,3.000000,7.300000,1.697800e+04,23.639000,7.500000
max,2022-01-01 00:00:00,225.000000,42.000000,9.500000,2.294231e+06,2274.044000,10.000000
std,NaN,39.596172,2.869428,1.131095,1.141492e+05,93.178235,1.078831

#### 数据统一性

In [51]:
D1["genres"].value_counts()

genres
drama            3357
comedy           2419
thriller         1446
action           1339
romance          1080
crime            1066
documentation     981
family            769
animation         732
fantasy           727
european          679
scifi             647
horror            438
history           336
music             266
reality           226
war               221
sport             188
western            53
Name: count, dtype: int64

In [53]:
D1["production_countries"].value_counts()

production_countries
US    5648
IN    1610
GB    1068
JP    1046
FR     720
      ...
GT       1
CU       1
LK       1
NP       1
FO       1
Name: count, Length: 108, dtype: int64

由于value_counts执行结果中有太多值，Pandas只会默认显示开头和结尾的一些值。要完整展示结果，可以把display.max_rows设置为None，即取消展示行数上限。

但因为我们只是在当前调用value_counts时才需要看完整结果，所以可以结合option_context，只更改临时上限。  
  
with pd.option_context('display.max_rows', None):
  
    print(df['column_name'].value_counts())

In [62]:
D1['production_countries']=D1['production_countries'].replace({"Lebanon":"LB"})

In [64]:
with pd.option_context('display.max_rows', None):
    print(D1['production_countries'].value_counts())

production_countries
US    5648
IN    1610
GB    1068
JP    1046
FR     720
KR     637
ES     637
CA     608
DE     383
CN     295
MX     264
IT     224
BR     221
AU     217
TR     195
PH     192
AR     150
ID     149
BE     148
TW     133
NG     131
PL     126
ZA     103
HK     102
NL     102
CO      94
EG      93
DK      89
TH      87
SE      81
LB      71
NO      68
AE      52
IE      49
SG      47
XX      43
IL      42
RU      41
CL      35
CH      33
PS      32
BG      31
MY      30
AT      28
SA      28
IS      28
LU      27
NZ      27
PE      26
RO      25
QA      24
CZ      22
JO      19
FI      18
HU      18
UY      15
MA      15
PT      14
KW      10
KH      10
PK       9
PR       9
UA       8
MT       8
VN       8
LT       7
IR       7
CD       7
SU       7
TN       7
SN       6
AL       6
KE       6
GH       6
IQ       5
MU       5
CY       5
KN       4
GR       4
IO       4
SY       4
TZ       4
MC       4
GL       3
CM       3
AO       3
BS       3
HR       3
BD       3
PY       3
DZ       3
KG       2
BT       2
BF       2
MW       2
RS       2
VE       2
ZW       2
VA       2
BY       2
NP       1
GE       1
AF       1
LK       1
GT       1
CU       1
FO       1
Name: count, dtype: int64

#### 保存D1为titles_cleaned.csv

In [68]:
D1.to_csv("titles_cleaned.csv")

In [70]:
D1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16970 entries, 1 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    16970 non-null  object
 1   title                 16970 non-null  object
 2   type                  16970 non-null  object
 3   description           16965 non-null  object
 4   release_year          16970 non-null  datetime64[ns]
 5   age_certification     10506 non-null  object
 6   runtime               16970 non-null  int64
 7   genres                16970 non-null  object
 8   production_countries  16670 non-null  object
 9   seasons               5954 non-null   float64
 10  imdb_id               16970 non-null  object
 11  imdb_score            16970 non-null  float64
 12  imdb_votes            16941 non-null  float64
 13  tmdb_popularity       16842 non-null  float64
 14  tmdb_score            16515 non-null  float64
dtypes: datetime64[ns](1), float64(5), int64(1), object(8)
memory usage: 2.1+ MB

#### 处理credits.csv 为D2

In [81]:
D2=pd.read_csv("credits.csv").copy()
D2.sample(10)

,person_id,id,name,character,role
70349,190808,ts317078,Yusuke Santamaria,Shinjiro Toyoda,ACTOR
32456,1155989,ts83906,Mark Towle,NaN,ACTOR
64841,1341394,tm1221677,Flossie McKnight,Rhoda,ACTOR
65117,2143453,tm979026,Adriel Flete,HS West Side Dancer #3,ACTOR
26557,726992,ts54117,Ciara Alexys,Luna Petunia (voice),ACTOR
71149,21539,tm1134006,Meghan Markle,Self (archive footage),ACTOR
70003,1043502,ts311791,Rob Sixsmith,NaN,DIRECTOR
21841,9141,tm134791,Renee Olstead,Jess Felton,ACTOR
41636,820913,tm459527,Afra Saraçoğlu,Ada,ACTOR
70002,253158,ts352579,Deniz Yorulmazer,NaN,DIRECTOR

#### 数据类型

In [88]:
D2["person_id"]=D2["person_id"].astype("str")

In [90]:
D2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77801 entries, 0 to 77800
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  77801 non-null  object
 1   id         77801 non-null  object
 2   name       77801 non-null  object
 3   character  68029 non-null  object
 4   role       77801 non-null  object
dtypes: object(5)
memory usage: 3.0+ MB

#### 数据重复

In [94]:
D2.duplicated().sum()

0

In [98]:
D2.describe()

       person_id       id         name character   role
count      77801    77801        77801     68029  77801
unique     54589     5489        54314     47274      2
top        48004  tm32982  Boman Irani      Self  ACTOR
freq          25      208           25      1950  73251

#### 保存D2 为 credits_cleaned.csv

In [131]:
D2.to_csv("credits_cleaned.csv")

In [133]:
D2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77801 entries, 0 to 77800
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  77801 non-null  object
 1   id         77801 non-null  object
 2   name       77801 non-null  object
 3   character  68029 non-null  object
 4   role       77801 non-null  object
dtypes: object(5)
memory usage: 3.0+ MB

## 整理数据

In [225]:
D=pd.merge(D2,D1,on="id") 
D.sample(5)

,person_id,id,name,character,role,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
45280,64201,tm164591,Ajay Devgn,Ajay Shastri,ACTOR,Apaharan,MOVIE,Story of a tumultuous and complex relationship...,2005-01-01,NaN,173,crime,IN,NaN,tt0451631,7.4,4773.0,3.860,6.3
177619,11277,tm1121246,Robbie Amell,Connor Reed,ACTOR,Code 8,MOVIE,"In Lincoln City, some inhabitants have extraor...",2019-01-01,NaN,99,action,GB,NaN,tt6259380,6.1,39469.0,18.193,6.2
90751,610324,ts53249,Lexi Medrano,Claire Nuñez (voice),ACTOR,Trollhunters: Tales of Arcadia,SHOW,"After uncovering a mysterious amulet, an avera...",2016-01-01,TV-Y7,22,animation,US,3.0,tt1734135,8.4,16779.0,50.896,8.5
195570,1049627,tm369389,María Ángeles Martín,Herself,ACTOR,The Silence of Others,MOVIE,The story of the tortuous struggle against the...,2019-01-01,NaN,95,documentation,US,NaN,tt8099236,8.0,2096.0,9.886,8.2
96586,692922,tm267135,Livia Dabarian,Executiva empresa 1,ACTOR,The Dreamseller,MOVIE,The main actor believes that true success is t...,2016-01-01,NaN,96,drama,BR,NaN,tt5496926,6.0,1468.0,11.071,6.5

只对演员感兴趣，筛选出role只为演员的观察值

In [228]:
D_actor=D[D["role"]=="ACTOR"]

根据流派分类,不同演员分类，获得每个演员多部作品imdb_score评分平均值

In [249]:
D_scoremean=D_actor.groupby(["genres","person_id"])["imdb_score"].mean()  
D_scoremean

genres   person_id
action   1000         6.866667
         100007       7.000000
         100013       6.400000
         100019       6.500000
         100020       6.500000
                        ...
western  993735       6.500000
         998673       7.300000
         998674       7.300000
         998675       7.300000
         99940        4.000000
Name: imdb_score, Length: 168881, dtype: float64

In [253]:
D_scoremean=D_scoremean.reset_index()
D_scoremean

         genres person_id  imdb_score
0        action      1000    6.866667
1        action    100007    7.000000
2        action    100013    6.400000
3        action    100019    6.500000
4        action    100020    6.500000
...         ...       ...         ...
168876  western    993735    6.500000
168877  western    998673    7.300000
168878  western    998674    7.300000
168879  western    998675    7.300000
168880  western     99940    4.000000

[168881 rows x 3 columns]

获得演员多个作品的平均评分后，再根据流派分类获得这个流派平均分最高的，以及其对应的演员id

In [256]:
D_scoremax=D_scoremean.groupby(["genres"])["imdb_score"].max()
D_scoremax

genres
action           9.3
animation        9.3
comedy           9.2
crime            9.5
documentation    9.1
drama            9.5
european         8.9
family           9.3
fantasy          9.3
history          9.1
horror           9.0
music            8.8
reality          8.9
romance          9.2
scifi            9.3
sport            9.1
thriller         9.5
war              8.8
western          8.9
Name: imdb_score, dtype: float64

得到每个流派最高分，但不知道对应的演员id，和之前的表进行连接

In [279]:
D_score=pd.merge(D_scoremax,D_scoremean,on=["genres","imdb_score"])  
D_score

      genres  imdb_score person_id
0     action         9.3     12790
1     action         9.3      1303
2     action         9.3     21033
3     action         9.3    336830
4     action         9.3     86591
..       ...         ...       ...
131      war         8.8    826547
132  western         8.9     22311
133  western         8.9     28166
134  western         8.9     28180
135  western         8.9     93017

[136 rows x 3 columns]

有了演员id，但不知道对应的演员名字，从D表中获取演员名字,并去除重复值

In [275]:
D_name=D[["person_id","name"]].drop_duplicates()   
D_name

       person_id                name
0           3748      Robert De Niro
2          14658        Jodie Foster
4           7064       Albert Brooks
6           3739       Harvey Keitel
8          48933     Cybill Shepherd
...          ...                 ...
276104    736339    Adelaida Buscato
276105    399499  Luz Stella Luengas
276106    373198         Inés Prieto
276107    378132        Isabel Gaona
276108   1950416      Julian Gaviria

[52544 rows x 2 columns]

与评分表进行连接

In [283]:
D_best=pd.merge(D_score,D_name,on="person_id")  
D_best

      genres  imdb_score person_id                name
0     action         9.3     12790         Olivia Hack
1     action         9.3      1303       Jessie Flower
2     action         9.3     21033          Zach Tyler
3     action         9.3    336830     André Sogliuzzo
4     action         9.3     86591       Cricket Leigh
..       ...         ...       ...                 ...
131      war         8.8    826547         Yuto Uemura
132  western         8.9     22311     Koichi Yamadera
133  western         8.9     28166  Megumi Hayashibara
134  western         8.9     28180      Unsho Ishizuka
135  western         8.9     93017            Aoi Tada

[136 rows x 4 columns]